"""
@pytest.mark.usefixtures()

- Позволяет использовать НЕСКОЛЬКО ФИКСТУР без явной передачи их в качестве параметра теста/функции.

⚠️Использовать только для логики, т.к. нет доступа к return этой фикстуры.
⚠️Если нужно использовать данные из return - использовать обычный способ (в качестве передаваемого аргумента функции).
"""
import pytest

#=======================================================================================================================
# Фикстуры:
@pytest.fixture
def fixture_1():
    print('[FIXTURE-1] 🚫Clear')

@pytest.fixture
def fixture_2():
    print('[FIXTURE-2] ✅Fill')


#------------------------------------------
# v.1 - Классический способ применения фикстур (передача фикстуры в качестве аргумента тест-функции)
class TestClass1:
    def func_1(self, fixture_1, fixture_2):
        ...

    def func_2(self, fixture_1, fixture_2):
        ...


# v.2 - Для .методов класса (тест-функций)
class TestClass2:
    @pytest.mark.usefixtures('fixture_1', 'fixture_2')
    def func_1(self):
        ...

    @pytest.mark.usefixtures('fixture_1', 'fixture_2')
    def func_2(self):
        ...


# v.3 - Для класса - применится ко всем .методам класса (тест-функцииям)
@pytest.mark.usefixtures('fixture_1', 'fixture_2')
class TestClass2:
    def func_1(self):
        ...

    def func_2(self):
        ...


#=======================================================================================================================
