"""
yield - возвращает результат функции и продолжить выполнение этой функции
"""
import pytest

#=======================================================================================================================
# Фикстура с yield - возвращает результат функции и продолжает выполнение после yield
@pytest.fixture
def user_data():
    print('\n[ДО Теста] - СОЗДАНИЕ пользователя (setup)')       # [ДО Теста]    - логика
    yield {'name': 'John'}                                      # [Передача данных в тест]
    print('[ПОСЛЕ Теста] - УДАЛЕНИЯ пользователя (teardown)')   # [ПОСЛЕ Теста] - логика


# Тест
def test_username(user_data):                 # Выполняется фикстура: [ДО Теста] - СОЗДАНИЕ пользователя (setup)
    print(user_data)                          # {'name': 'John'}
    assert user_data['name'] == 'John'        # PASSED
                                              # Выполняется фикстура: [ПОСЛЕ Теста] - УДАЛЕНИЯ пользователя (teardown)

#=======================================================================================================================
