"""
Icon element
"""
from elements.base_element import BaseElement

#=======================================================================================================================
class Icon(BaseElement):
    """
    - ❌ НЕ ВЫЗЫВАТЬ НАПРЯМУЮ базовые методы из Родительского класса - BaseElement()!
    - ✅ Вызывать ТОЛЬКО ЧЕРЕЗ ЭТОТ Дочерний класс элемента!
    """
    pass

#=======================================================================================================================
