"""
Text element
(⚠️Page factory)
"""
from elements_.base_element_ import BaseElement

#=======================================================================================================================
class Text(BaseElement):
    """
    - ❌ НЕ ВЫЗЫВАТЬ НАПРЯМУЮ базовые методы из Родительского класса - BaseElement()!
    - ✅ Вызывать ТОЛЬКО ЧЕРЕЗ ЭТОТ Дочерний класс элемента!
    """
    # Переопределенный метод
    @property
    def type_of(self) -> str:
        return 'text'

#=======================================================================================================================
