"""
ids - Идентификатор (описание) для каждого параметра parametrize ✨
"""

"""
- заменяет имя параметра на идентификатор (при выводе)
- но логика выполняется по самому значению параметра
https://docs.pytest.org/en/stable/example/parametrize.html#different-options-for-test-ids
"""
import pytest

#================================================= Статичные параметры =================================================
@pytest.mark.parametrize(
    'phone_number', ['(111)111-0011', '(111)111-0022', '(111)111-0033'] # 'название_параметра', ['value_1', 'value_2'...]
)
def test_1(phone_number: str):       # передаем параметр (со значениями по очереди)
    ...                              # 1[(111)111-0011]  PASSED
                                     # 1[(111)111-0022]  PASSED
                                     # 1[(111)111-0033]  PASSED

#--------------------------------------------------------- ids ---------------------------------------------------------
@pytest.mark.parametrize(
    'phone_number', ['(111)111-0011', '(111)111-0022', '(111)111-0033'], # 'название_параметра', ['value_1', 'value_2'...]
    ids=['CEO', 'Manager', 'Engineer']                                   # Идентификаторы (описание) для каждого параметра соответственно (хард-код)
)
def test_2(phone_number: str):       # передаем параметр (со значениями по очереди) но выводится его id
    ...                              # [CEO]      PASSED
                                     # [Manager]  PASSED
                                     # [Engineer] PASSED



#================================================== Пример с логикой ===================================================
@pytest.mark.parametrize('number', [1, 2, 3])  # 'название_параметра', ['value_1', 'value_2'...]
def test_3(number: int):                       # передаем параметр (с value по очереди)
    print(f'10 + {number} = {10 + number}')    # test_3[1]  10 + 1 = 11  PASSED
                                               # test_3[2]  10 + 2 = 12  PASSED
                                               # test_3[3]  10 + 3 = 13  PASSED

#--------------------------------------------------------- ids ---------------------------------------------------------
@pytest.mark.parametrize(
    'number', [1, 2, 3],                       # 'название_параметра', ['value_1', 'value_2'...]
    ids=['One', 'Two', 'Three']                #  Идентификаторы (описание) для каждого параметра соответственно (хард-код)
)
def test_4(number: int):                       # передаем параметр (с value по очереди), но выводится его id, а логика выполняется по самому value параметра
    print(f'10 + {number} = {10 + number}')    # test_4[One]   10 + 1 = 11  PASSED
                                               # test_4[Two]   10 + 2 = 12  PASSED
                                               # test_4[Three] 10 + 3 = 13  PASSED



#=============================================== ДИНАМИЧЕСКИЕ параметры ================================================
# Dict - словарь ('key': 'value')
users = {
    '111-0011': 'John',
    '111-0022': 'Mike',
    '111-0033': 'Robert'
}

#------------------------------------------ Вывод по идентификатору (простой) ------------------------------------------
@pytest.mark.parametrize(
    'phone_number', users.keys(),   # 'Название параметра', [KEYS словаря] = [111-0011, 111-0022, 111-0033]
    ids=list(users.values())        # [Идентификаторы для каждого параметра - VALUES словаря]
    # ids=company.values()          # - Тоже работает (но менее корректный вариант)
)
def test_5(phone_number: str):
    ...                             # test_5[John]   PASSED
                                    # test_5[Mike]   PASSED
                                    # test_5[Robert] PASSED



#------------------------------------------ Вывод по СБОРНОМУ идентификатору -------------------------------------------
# v.1 - function
def func(phone_number: str) -> str:
    return f'{phone_number}: {users[phone_number]}'


@pytest.mark.parametrize(
    'phone_number', users.keys(),        # 'Название параметра', [KEYS словаря],
    ids=func                             # 👈Передаем функцию для автоматического вызова (ids с функцией — это CALLBACK)
                                         # - т.е. функция, которую передают другой функции, чтобы та вызвала её сама в нужный момент
)
def test_6_func(phone_number: str):
    ...                                  # test_6_func[111-0011: John]   PASSED
                                         # test_6_func[111-0022: Mike]   PASSED
                                         # test_6_func[111-0033: Robert] PASSED



# v.2 - ✨lambda
@pytest.mark.parametrize(
    'phone_number', users.keys(),        # 'Название параметра', [KEYS словаря],
    ids=lambda x: f'{x}: {users[x]}'     # 👈[Формируем сборный идентификатор для каждого параметра - VALUES словаря]
                                         # ℹ️⮕ lambda ✨АВТОМАТОМ принимает параметр - key 'сверху' и формирует:
                                         # ℹ️⮕ ids=lambda KEY: f'KEY: {users[KEY]}' <— сборный идентификатор ('key': 'value')
                                         # ℹ️⮕ ❗️потому что ids с функцией — это CALLBACK -
                                         # - т.е. функция, которую вы передаёте другой функции, чтобы та вызвала её сама в нужный момент
)
def test_7_lambda(phone_number: str):
    ...                                  # test_7_lambda[111-0011: John]   PASSED
                                         # test_7_lambda[111-0022: Mike]   PASSED
                                         # test_7_lambda[111-0033: Robert] PASSED

#=======================================================================================================================
