"""
Pytest marker <skipif>
Пропуск теста при условии
"""
"""
Пропуск теста, если например: запуск на другой OS или её версии, или другом окружении, или любое другое условие)
"""
import pytest

#=======================================================================================================================
# ПРИМЕР API ответа с OS
OS = 'Windows'
#-----------------------------------------------------------------------------------------------------------------------

# Test 1
@pytest.mark.skipif(                                # Пропусить тест если...
    OS == 'MacOS',                                  # ... OS: MacOS
    reason=f'Тест не поддерживается для OS: {OS}'   # Описание причины пропуска
)
def test_1():                                       # PASSED
    ...

# Test 2
@pytest.mark.skipif(                                # Пропусить тест если ...
    OS == 'Linux',                                  # ... OS: Linux
    reason=f'Тест не поддерживается для OS: {OS}'   # Описание причины пропуска
)
def test_2():                                       # PASSED
    ...

# Test 3
@pytest.mark.skipif(                                # Пропусить тест если ...
    OS == 'Windows',                                # ... OS: Windows
    reason=f'Тест не поддерживается для OS: {OS}'   # Описание причины пропуска
)
def test_3():                                       # Skipped: Тест не поддерживается для OS: Windows
    ...

#-----------------------------------------------------------------------------------------------------------------------
